In [24]:
import numpy as np
import pandas as pd
from sklearn.impute import SimpleImputer
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                    [3, 4, np.nan, 1],
                    [np.nan, np.nan, 2, 5],
                    [np.nan, 3, np.nan, 4]],
                   columns=list('ABCD'))

In [25]:
df

     A    B    C  D
0  NaN  2.0  NaN  0
1  3.0  4.0  NaN  1
2  NaN  NaN  2.0  5
3  NaN  3.0  NaN  4

In [26]:
df.fillna(method='ffill')

     A    B    C  D
0  NaN  2.0  NaN  0
1  3.0  4.0  NaN  1
2  3.0  4.0  2.0  5
3  3.0  3.0  2.0  4

In [30]:
values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}

In [31]:
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5
3  0.0  3.0  2.0  4